/*// 1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.
let firstArr = ['a', 'b', 'c'];
let secondArr = [1, 2, 3];
//let resArr = [...firstArr, ...secondArr];
let resArr = [];
for (let i = 0; i < secondArr.length; i++){
    resArr.push(secondArr[i]);
    resArr.push(firstArr[i]);
}
console.log(resArr, 'res')*/

/*// 2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3. (через push и через splice)
let arrPush = ['a', 'b', 'c'];
let arrSplice = ['a', 'b', 'c'];
let arrFor = ['a', 'b', 'c'];
arrPush.push(1, 2, 3);
arrSplice.splice(3, 0, 1, 2, 3);
for (let i = 1; i < 3; i++){
    arrFor.push(i);
}*/



/*// 3) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
let arr = [1, 2, 3, 4, 5];
arr.splice(1, 2);*/

/*
// 4) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
let arr = [1, 2, 3, 4, 5];
arr.splice(3, 0 , 'a', 'b', 'c')
*/

/*// 5) Дан массив const arr = [1, 2, 3, 4, 5]. Создать новый пустой массив arr1.
// Обойти массив arr через цикл for, каждый элемент массива arr умножить на 10 и результат положить в массив arr1.

const arr = [1, 2, 3, 4, 5];
const arr1 = [];
const ten = 10;

for (let i = 0; i < arr.length; i++){
    arr1.push(arr[i] * ten)
}*/

/*// 6) Вывести числа от 4 до 400 на экран.
const startNumber = 4;
const endNumber = 400;
for (let i = startNumber; i <= endNumber; i++){
    console.log(i)
}*/

/*// 7) Вывести числа в последовательности: 4 7 10 13 с помощью цикла.

for (let i = 4; i <= 13; i += 3){
    console.log(i)
}*/

/*// 8) Вывести числа 654 653 652 до нуля.

for (let i = 654; i >= 0; i--){
    console.log(i)
}*/

/*
// 9) Вывести все годы с 1983 до 2017.
for (let i = 1983; i <= 2017; i++){
    console.log(`${i}год`)
}
*/

/*// 10) Вывести числа -4 -2 0 2 4 6 ...100.

for (let i = -4; i <= 100; i++){
    if (i % 2 === 0){
        console.log(i)
    }
}*/

/*// 11) Найти сумму чисел от 0 до 100 (включительно). (0+1+2+3+4+5)

let res = 0;
for (let i = 0; i <= 100; i++){
    res += i;
}*/

/*// 12) Заполните массив следующим образом: в первый элемент запишите 'x',
//     во второй 'xx', в третий 'xxx' и так далее. Длину массива вводить через prompt.
let arrLen = +prompt('Enter number of "x"')
let res = [];

for (let i = 1; i <= arrLen; i++){
    let x = '';
        for(let j = 0; j < i; j++){
        x += 'x'
    }
        res.push(x)
}*/


/*// 13) Заполните массив следующим образом: в первый элемент запишите '1',
//     во второй '22', в третий '333' и так далее. Длину массива вводить через prompt.

let arrLen = +prompt('Enter number of "x"')
let res = [];

for (let i = 1; i <= arrLen; i++){
    let x = ``;
    for(let j = 0; j < i; j++){
        x += `${i}`
    }
    res.push(x)
}*/

/*// 14*) нарисовать матрицу x должны быть по краям, 0 в центре. ( длина и высота матрицы не меньше 10 )
// ['x', 'x', 'x', 'x', 'x' 'x', 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
//     ['x', 'x', 'x', 'x', 'x', 'x','x']

let ver = [];
for (let i = 0; i < 10; i++){
    let hor = [];

    for (let j = 0; j < 10; j++){
        let x = 0;

        if ( i === 0 || j === 0 || j === 9 || i === 9 ){
            x = 'x';
        }

        hor.push(x)
    }
    ver.push(hor)
}

console.log(ver)*/

//
/*
// 15*) нарисовать матрицу (таблица умножения)
// 0: (10) [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// 1: (10) [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
// 2: (10) [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]
// 3: (10) [4, 8, 12, 16, 20, 24, 28, 32, 36, 40]
// 4: (10) [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]
// 5: (10) [6, 12, 18, 24, 30, 36, 42, 48, 54, 60]
// 6: (10) [7, 14, 21, 28, 35, 42, 49, 56, 63, 70]
// 7: (10) [8, 16, 24, 32, 40, 48, 56, 64, 72, 80]
// 8: (10) [9, 18, 27, 36, 45, 54, 63, 72, 81, 90]
// 9: (10) [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

let ver = [];
for (let i = 1; i <= 10 ; i++){
    let hor = [];
    for (let j = 1 ; j <= 10; j++){
        hor.push(i * j)
    }
    ver.push(hor)
}
console.log(ver)
*/


// 16*)	Написать программу которая будет склонять слово
// 	“товар” в зависимости от количества товаров в корзине.
//     Например 1 - товар, 4 - товара, 6 - товаров.

let getNumber = +prompt('number');
let setNumber = getNumber % 100;
if (setNumber >=5 && setNumber <= 20){
    alert(`вы купили ${getNumber} товаров`)
}else if (setNumber > 1 && setNumber < 5){
    alert(`вы купили ${getNumber} товарa`)
}else if (setNumber === 1){
    alert(`вы купили ${getNumber} товар`)
}else (alert(`вы купили ${getNumber} товаров`))
